<script setup lang="ts">
const text = ref<string>(`
  当秋天洒下最后一把枫叶时
  正是我要离开的时候
  看着收拾好的行李 想起远方的你
  心里竟然有一股 幸福的感觉
  就在这个时候 地上的枫叶 刹那间...
  飞起来 飞过来 飞进我 深深心怀
  越过那 宁静海 充满着 回忆的海
  那阳光 洒下了爱
  催促着 万物绽开
  那彩虹 像个小孩
  勇敢的 坚定的 站起来
  飞过那 矮竹篱
  擦过那 斑驳墙壁
  发黄的 照片里
  痛快着 那么熟悉
  不经意 和你相遇
  在天空 飘着小雨
  落下来 清澈的溪
  甜美的 每一点 每一滴
  枫叶啊 载满着我的感动
  枫叶啊 倾听着我心情衷
  深秋里 伴随着亮丽的梦
  冲向我 化成了满山和满谷的对你思念
  写满了满地和满天的爱的诗篇
  咏叹着生命的美丽和世界的无限
  飞舞在以后和从前 它连成一片
  随着溪 流了去
  随着河 又流了来
  离去时 心感激
  回来时 满心期待
  因为爱 所以存在
  露湿的 绿色青苔
  晨曦中迎风而来
  飞进了 我心中 的大海
  枫叶啊 载满着我的感动
  枫叶啊 倾听着我心情衷
  深秋里 伴随着亮丽的梦
  冲向我 化成了满山和满谷的对你思念
  写满了满地和满天的爱的诗篇
  咏叹着生命的美丽和世界的无限
  飞舞在以后和从前 它连成一片
  化成了满山和满谷的对你思念
  写满了满地和满天的爱的诗篇
  咏叹着生命的美丽和世界的无限
  飞舞在以后和从前 它连成一片
  化成了满山和满谷的对你思念
  写满了满地和满天的爱的诗篇
  咏叹着生命的美丽和世界的无限
  飞舞在以后和从前 它连成一片
`)
</script>

<template>
  <div wh-full>
    <div w="600px" h="600px" overflow-hidden class="content" leading-6>
      {{ text.repeat(2) }}
    </div>
  </div>
</template>

<style scoped lang="scss">
.content {
  color: transparent;
  background: url(../../assets/img/006.gif) center/cover;
          background-clip: text;

  -webkit-background-clip: text;
}
</style>
